tutorials/combustion/fireFoam/les/smallPoolFire2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 1e-4;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 1e-4;
    }
    base
    {
        type            fixedValue;
        value           uniform 1e-4;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-4;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
